Revit 2026 API

# PrintManagerPrintRange Property

---

The print range.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public PrintRange PrintRange { get; set; }
```
```vb
Public Property PrintRange As PrintRange
	Get
	Set
```
```cpp
public:
property PrintRange PrintRange {
	PrintRange get ();
	void set (PrintRange value);
}
```
```fsharp
member PrintRange : PrintRange with get, set
```

#### Property Value

PrintRange

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | Thrown when the argument is out of range. |

The value of this property represents the global print setting property used for print operations on any document. In order to make a change to this property, after setting it call the Apply() method, or one of the SubmitPrint() methods, which save the local changes as modifications to the global print settings.

#### Reference

PrintManager Class

Autodesk.Revit.DB Namespace